#Дано натуральное восьмизначное число. Выясните, является ли оно палиндромом (читается одинаково слева направо и справа налево).

num = 123454321
print(str(num) == str(num)[::-1])


#Преобразование числа в строку и ее переворот.

num2 = 123456789
print(str(num2)[::-1])



