num = 123454321
num2 = 123456789

print(str(num) == str(num)[::-1])

print(str(num2)[::-1]) #Преобразование числа в строку и ее переворот.

#Дано натуральное восьмизначное число. Выясните, является ли оно палиндромом (читается одинаково слева направо и справа налево).

