tickets = int(input("Введите колличество билетов: "))

total_cost = 0
discount = False

for i in range(tickets):
    age = int(input(f"Введите возраст посетителя №{i+1}: "))
    if age < 18:
        continue
    elif 18 <= age <= 25:
        total_cost += 990
    elif age >= 25:
        total_cost += 1390

if tickets > 3:
    discount = True
    total_cost -= total_cost * 0.1

print(f"Общая стоимость билетов: {int(total_cost)} руб.")
if discount:
    print("Вам предоставлена скидка 10%.")



#Для онлайн-конференции необходимо написать программу, которая будет подсчитывать общую стоимость билетов.
#Программа должна работать следующим образом:

#1. В начале у пользователя запрашивается количество билетов, которые он хочет приобрести на мероприятие.
#2. Далее для каждого билета запрашивается возраст посетителя, в соответствии со значением которого выбирается стоимость:

#Если посетителю конференции менее 18 лет, то он проходит на конференцию бесплатно.
#От 18 до 25 лет — 990 руб.
#От 25 лет — полная стоимость 1390 руб.
#3. В результате программы выводится сумма к оплате. При этом, если человек регистрирует больше
#трёх человек на конференцию, то дополнительно получает 10% скидку на полную стоимость заказа.