# Практика по PYTHON на курсе SKILLFACTORY.
### В этом репозитории я собираю все **свои** практические работы, выполненные в процессе прохождения курса. 
#### *Я сохраняю их здесь, чтобы в любой момент освежить свои знания в написании конкретного кода. Кроме того, это также служит своего рода **портфолио** моих работ.*
___

***ПРИМЕР ВЫПОЛНЕННЫХ МНОЮ ЗАДАНИЙ***

* Для онлайн-конференции необходимо написать программу, которая будет подсчитывать общую стоимость билетов. При этом, если человек регистрирует больше
трёх человек на конференцию, то дополнительно получает 10% скидку на полную стоимость заказа.
```python
tickets = int(input("Введите колличество билетов: "))

total_cost = 0
discount = False

for i in range(tickets):
    age = int(input(f"Введите возраст посетителя №{i+1}: "))
    if age < 18:
        continue
    elif 18 <= age <= 25:
        total_cost += 990
    elif age >= 25:
        total_cost += 1390

if tickets > 3:
    discount = True
    total_cost -= total_cost * 0.1

print(f"Общая стоимость билетов: {int(total_cost)} руб.")
if discount:
    print("Вам предоставлена скидка 10%.")
```
* Напишите программу, в результате которой будет сформирован список *deposit* значений — накопленные средства за год вклада в каждом из банков.

```python
per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}

# Ввод суммы под проценты
money = float(input('Введите сумму, которую вы планируете положить под проценты: '))

# Расчет и вывод накопленных средств для каждого банка
for bank, percent in per_cent.items():
    deposit_amount = int(money * percent / 100)
    print(f'Накопленные средства в банке {bank}: {deposit_amount} руб.')

# Поиск и вывод максимальной суммы
max_deposit = max(per_cent.values())
print(f'Максимальная сумма, которую вы можете заработать: {int(money * max_deposit / 100)} руб.')
```

***Скоро здесь появятся еще задания...***:sleeping:
